load_testing/load_test.yml
config:
  target: "https://www.rubyevents.org"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 45
      name: Ramp up load
  payload:
    - path: search_payload.csv
      fields:
        - name
    - path: talks_payload.csv
      fields:
        - talk_slug
scenarios:
  - name: "visit home page"
    flow:
      - get:
          url: "/talks"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/talk/{{ talk_slug }}"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/talk/{{ talk_slug }}"
      - get:
          url: "/talks?q={{ name }}"
      - get:
          url: "/speakers"